modules/admin/models/UserDetailQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `user_detail` WHERE `user_id`=31