controllers/SiteController.php

	public function actionLogin()
	{

		if (!Yii::$app->user->isGuest) {
			return	$this->redirect('index');
		}
		$model = new LoginForm();
		if (Yii::$app->request->isAjax && $model->load(Yii::$app->request->post())) {
			Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
			return ActiveForm::validate($model);
			\Yii::$app->end();
		}
		if ($model->load(Yii::$app->request->post())) {
			$user_verification = User::find()->where(['username' => $model['username']])->orWhere(['email' => $model['username']])->one();
---
SELECT * FROM `user` WHERE (`username`='Test001@gmail.com') OR (`email`='Test001@gmail.com')