models/User.php

	public static function findByUsername($username)
	{
		//return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
		/*return static::findOne(['OR',
		[ 'username' => $username],['contact_no'=>$username]]);*/

		$user = User::find()->where([ 'email' => $username ])
---
SELECT * FROM `user` WHERE `email`='Test001@gmail.com'